[
  {
    "commentText": "I'm not sure if this is the right place to ask this, but I'm trying to find a way to get the current user's email address in a custom field. I've tried using the following code, but it doesn't seem to work. Any ideas?",
    "userId": 5,
    "postId": 1
  },
  {
    "commentText": "Outer space exists because it's afraid to be on the same planet with Chuck Norris A Handicapped parking sign does not signify that this spot is for handicapped people.",
    "userId": 1,
    "postId": 1
  },
  {
    "commentText": "If you spell Chuck Norris in Scrabble, you win.",
    "userId": 2,
    "postId": 1
  },
  {
    "commentText": "Contrary to popular belief, Chuck Norris, not the box jellyfish of northern Australia, is the most venomous creature on earth, When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack.",
    "userId": 5,
    "postId": 1
  },
  {
    "commentText": "Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie down. Chuck Norris doesn't wash his clothes, he disembowels them The quickest way to a man's heart is with Chuck Norris' fist.",
    "userId": 3,
    "postId": 1
  },
  {
    "commentText": "I'm not sure if this is the right place to ask this, but I'm trying to find a way to get the current user's email address in a custom field. I've tried using the following code, but it doesn't seem to work. Any ideas?",
    "userId": 5,
    "postId": 2
  },
  {
    "commentText": "Outer space exists because it's afraid to be on the same planet with Chuck Norris.",
    "userId": 1,
    "postId": 2
  },
  {
    "commentText": "Forever Chuck Norris can win a game of Connect Four in only three moves.",
    "userId": 2,
    "postId": 2
  },
  {
    "commentText": "When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack.",
    "userId": 5,
    "postId": 2
  },
  {
    "commentText": "Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie down. Chuck Norris doesn't wash his clothes, he disembowels them The quickest way to a man's heart is with Chuck Norris' fist.",
    "userId": 3,
    "postId": 2
  },
  {
    "commentText": "Chuck Norris has not had to pay taxes, ever. If you spell Chuck Norris in Scrabble, you win. Forever You better watch out, You better not cry. You'd better not pout, I'm telling you why - cos Chuck Norris is kick-ing your ass.",
    "userId": 3,
    "postId": 3
  }
]